app/views/courses/show.html.erb

  <strong>강의수:</strong>
  <%= @course.class_lists.count %>
---
SELECT "class_lists".* FROM "class_lists" WHERE "class_lists"."course_id" = $1  [["course_id", 3]]
SELECT COUNT(*) FROM "class_lists" WHERE "class_lists"."course_id" = $1  [["course_id", 3]]

  <tbody>
    <% @course.class_lists.each do |lesson| %>
---
SELECT "class_lists".* FROM "class_lists" WHERE "class_lists"."course_id" = $1  [["course_id", 3]]