app/controllers/class_lists_controller.rb

SELECT "class_lists".* FROM "class_lists"
---
  def index
    @class_lists = ClassList.all

SELECT "class_lists".* FROM "class_lists" WHERE "class_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_class_list
      	@class_list = ClassList.find(params[:id])