app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
    @courses = Course.all

INSERT INTO "courses" ("class_name", "description", "youtube_playlist_id", "provider", "created_at", "updated_at", "thumbnail_url") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "courses".* FROM "courses" WHERE "courses"."youtube_playlist_id" = $1 LIMIT $2  [["youtube_playlist_id", "PLgqG2uj21HgkWctgULIHGkfFMR0VKw4Qv"], ["LIMIT", 1]]
---
  def import_youtube
    playlist_url = params[:playlist_url]
    youtube_data = parse_youtube_url(playlist_url)

    playlist_id = youtube_data[:playlist_id]
    if playlist_id.nil?
      redirect_to courses_path, alert: '유효한 YouTube 재생목록 URL을 입력하세요.'
      return
    end

    youtube_service = YoutubeService.new(ENV['YOUTUBE_API_KEY'])

    # 재생목록 정보 가져오기
    playlist_info = youtube_service.fetch_playlist(playlist_id)

    # `courses` 테이블에 저장
    course = Course.find_or_create_by!(youtube_playlist_id: playlist_id) do |c|

INSERT INTO "class_lists" ("course_id", "lesson_name", "description", "youtube_video_id", "duration", "created_at", "updated_at", "thumbnail_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "class_lists".* FROM "class_lists" WHERE "class_lists"."course_id" = $1 AND "class_lists"."youtube_video_id" = $2 LIMIT $3  [["course_id", 4], ["youtube_video_id", "4inLYlZOKAU"], ["LIMIT", 1]]
---
        next
      end

      course.class_lists.find_or_create_by!(youtube_video_id: video[:youtube_video_id]) do |lesson|

UPDATE "courses" SET "description" = $1, "sessions_count" = $2, "updated_at" = $3 WHERE "courses"."id" = $4  [["description", "Ruby on rails로 실제 어플리케이션을 만드는 것을 배울 수 있은 강좌입니다.\r\n배우는 개념"], ["sessions_count", 28], ["updated_at", "2024-11-24 14:39:36.255917"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_course
      @course = Course.find(params[:id])