app/controllers/tests_controller.rb

  def index
    @tests = Test.all
---
SELECT "tests".* FROM "tests"